Revit 2027 API
TessellatedShapeBuilder.OwnerInfo Property
 String used for logging, if any. Usually describes the element or object, which either defined or will own the geoemtrical objects to be built.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OwnerInfo { get; set; }
Public Property OwnerInfo As String
	Get
	Set
public:
property String^ OwnerInfo {
	String^ get ();
	void set (String^ value);
}
member OwnerInfo : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace